// 1. Вивести на екран всі числа від 1 до 10 за допомогою циклу while.


// let i = 1;
// while(i <= 10){
//     console.log(i);
//     i += 1;

// }

// 2. Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

// for(let i = 2;i <= 20; i += 1) {
//     if(i % 2 === 0){
//         continue;
//     }

//     console.log(i);
// }



// 3. Вивести на екран таблицю множення числа 7 за допомогою циклу for.

// for (let i = 1; i<= 10; i += 1){
//     console.log(`7 x ${i} = ${7 * i}`);
// }

//4. Вивести числа від 1 до 7.

// let i = 1;
// while (i <= 7) {
//     console.log(i);
//     i += 1;
// }

// 5. За допомогою циклу for пройтися по числах та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

// for(let i = 1; i <= 10; i += 1){
//     if(i === 7){
//         break;
//     }
//     console.log(i);
// }

// 6. Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою оператора break.

// let n = 8;

// for(let i = 1; ; i += 1){
//     if(i >= n){
//         break;
//     }
//     console.log(i);
// }


//7. За допомогою циклу while вивести на екран всі числа від 1 до 20,
// крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let i = 1;
while (i <= 20) {
    if(i % 3 === 0){
        i += 1;
        continue;
    }
    console.log(i);
    i += 1;
}